





INTERNET-DRAFT                                   Robert Herriot (editor)
<draft-ietf-ipp-notify-get-00.txt>                           Xerox Corp.
                                                             Carl Kugler
                                                              IBM, Corp.
                                                             Harry Lewis
                                                              IBM, Corp.
                                                      September 18, 2000
                   Internet Printing Protocol (IPP):
                 The 'ippget' Event Notifications Delivery Method

    Copyright (C) The Internet Society (2000). All Rights Reserved.

Status of this Memo:

This document is an Internet-Draft and is in full conformance with all
provisions of Section 10 of [rfc2026].  Internet-Drafts are working
documents of the Internet Engineering Task Force (IETF), its areas, and
its working groups.  Note that other groups may also distribute working
documents as Internet-Drafts.

Internet-Drafts are draft documents valid for a maximum of six months
and may be updated, replaced, or obsoleted by other documents at any
time.  It is inappropriate to use Internet-Drafts as reference material
or to cite them other than as "work in progress".

The list of current Internet-Drafts can be accessed at
http://www.ietf.org/ietf/1id-abstracts.txt

The list of Internet-Draft Shadow Directories can be accessed as
http://www.ietf.org/shadow.html.


Abstract


The notification extension document [ipp-ntfy] defines operations that a
client can perform in order to create Subscription Objects in a Printer
and carry out other operations on them. A Subscription Object represents
a Subscription abstraction. The Subscription Object specifies that when
one of the specified Events occurs, the Printer sends an asynchronous
Event Notification to the specified Notification Recipient via the
specified Delivery Method (i.e., protocol).


The notification extension document [ipp-ntfy] specifies that each
Delivery Method is defined in another document. This document is one
such document, and it specifies the 'ippget' delivery method.




Herriot, et al.         Expires: March 18, 2001                 [page 1]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

The 'ippget' Delivery Method is a 'pull and push' Delivery Method. That
is, the Printer saves Event Notification for a period of time and
expects the Notification Recipient to fetch the Event Notifications (the
pull part). The Printer continues to send Event Notifications to the
Notification Recipient as Events occur (the push part) if the client has
selected the option to wait for additional Event Notifications.


When a Printer supports this Delivery Method, it holds each Event
Notification for an amount of time, called the Event Notification Lease
Time.


When a Notification Recipient wants to receive Event Notifications, it
performs an IPP operation called 'Get-Notifications', which this
document defines. This operation causes the Printer to return all Event
Notifications held for the Notification Recipient. If the Notification
Recipient has selected the option to wait for additional Event
Notifications, the Printer continues sending Event Notifications to the
Notification Recipient as additional Events occur.
































Herriot, et al.         Expires: March 18, 2001                 [page 2]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

The basic set of IPP documents includes:

  Design Goals for an Internet Printing Protocol [RFC2567]
  Rationale for the Structure and Model and Protocol for the Internet
     Printing Protocol [RFC2568]
  Internet Printing Protocol/1.1: Model and Semantics [RFC2911]
  Internet Printing Protocol/1.1: Encoding and Transport [RFC2910]
  Internet Printing Protocol/1.1: Implementer's Guide [ipp-iig]
  Mapping between LPD and IPP Protocols [RFC2569]
  Internet Printing Protocol/1.0 & 1.1: IPP Event Notification
     Specification [ipp-ntfy]

The "Design Goals for an Internet Printing Protocol" document takes a
broad look at distributed printing functionality, and it enumerates
real-life scenarios that help to clarify the features that need to be
included in a printing protocol for the Internet.  It identifies
requirements for three types of users: end users, operators, and
administrators.  It calls out a subset of end user requirements that are
satisfied in IPP/1.0.  A few OPTIONAL operator operations have been
added to IPP/1.1.

The "Rationale for the Structure and Model and Protocol for the Internet
Printing Protocol" document describes IPP from a high level view,
defines a roadmap for the various documents that form the suite of IPP
specification documents, and gives background and rationale for the IETF
working group's major decisions.

The "Internet Printing Protocol/1.1: Model and Semantics" document
describes a simplified model with abstract objects, their attributes,
and their operations that are independent of encoding and transport.  It
introduces a Printer and a Job object.  The Job object optionally
supports multiple documents per Job.  It also addresses security,
internationalization, and directory issues.

The "Internet Printing Protocol/1.1: Encoding and Transport" document is
a formal mapping of the abstract operations and attributes defined in
the model document onto HTTP/1.1 [RFC2616].  It defines the encoding
rules for a new Internet MIME media type called "application/ipp".  This
document also defines the rules for transporting over HTTP a message
body whose Content-Type is "application/ipp".  This document defines a
new scheme named 'ippget' for identifying IPP printers and jobs.

The "Internet Printing Protocol/1.1: Implementer's Guide" document gives
insight and advice to implementers of IPP clients and IPP objects.  It
is intended to help them understand IPP/1.1 and some of the
considerations that may assist them in the design of their client and/or
IPP object implementations.  For example, a typical order of processing
requests is given, including error checking.  Motivation for some of the
specification decisions is also included.



Herriot, et al.         Expires: March 18, 2001                 [page 3]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

The "Mapping between LPD and IPP Protocols" document gives some advice
to implementers of gateways between IPP and LPD (Line Printer Daemon)
implementations.


The "Event Notification Specification" document describes an extension
to the IPP/1.0, IPP/1.1, and future versions. This extension allows a
client to subscribe to printing related Events. Subscriptions are
modeled as Subscription Objects.  The Subscription Object specifies that
when one of the specified Event occurs, the Printer sends an
asynchronous Event Notification to the specified Notification Recipient
via the specified Delivery Method (i.e., protocol).  A client associates
Subscription Objects with a particular Job by performing the Create-Job-
Subscriptions operation or by submitting a Job with subscription
information.  A client associates Subscription Objects with the Printer
by performing a Create-Printer-Subscriptions operation.  Four other
operations are defined for Subscription Objects: Get-Subscriptions-
Attributes, Get-Subscriptions, Renew-Subscription, and Cancel-
Subscription.

































Herriot, et al.         Expires: March 18, 2001                 [page 4]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000



                           Table of Contents


1  Introduction ......................................................6

2  Terminology .......................................................6

3  Model and Operation ...............................................7

4  General Information ...............................................8

5  Get-Notifications operation ......................................10
 5.1 Get-Notifications Request.......................................11
 5.2 Get-Notifications Response......................................12

6  Additional Printer Description Attributes ........................19
 6.1 begin-to-expire-time-interval" (integer(0:MAX)).................19

7  New Status Codes .................................................19
 7.1 redirection-other-site (0x300)..................................20

8  Encoding .........................................................20

9  Conformance Requirements .........................................20

10 IANA Considerations ..............................................21

11 Internationalization Considerations ..............................21

12 Security Considerations ..........................................21

13 References .......................................................21

14 Authors' Addresses ...............................................22

15 Full Copyright Statement .........................................23














Herriot, et al.         Expires: March 18, 2001                 [page 5]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

1  Introduction


The notification extension document [ipp-ntfy] defines operations that a
client can perform in order to create Subscription Objects in a Printer
and carry out other operations on them. A Subscription Object represents
a Subscription abstraction. The Subscription Object specifies that when
one of the specified Events occurs, the Printer sends an asynchronous
Event Notification to the specified Notification Recipient via the
specified Delivery Method (i.e., protocol).


The notification extension document [ipp-ntfy] specifies that each
Delivery Method is defined in another document. This document is one
such document, and it specifies the 'ippget' delivery method.


The 'ippget' Delivery Method is a 'pull and push' Delivery Method. That
is, the Printer saves Event Notification for a period of time and
expects the Notification Recipient to fetch the Event Notifications (the
pull part). The Printer continues to send Event Notifications to the
Notification Recipient as Events occur (the push part) if the client has
selected the option to wait for additional Event Notifications.


When a Printer supports this Delivery Method, it holds each Event
Notification for an amount of time, called the Event Notification Lease
Time.


When a Notification Recipient wants to receive Event Notifications, it
performs an IPP operation called 'Get-Notifications', which this
document defines. This operation causes the Printer to return all Event
Notifications held for the Notification Recipient. If the Notification
Recipient has selected the option to wait for additional Event
Notifications, the Printer the Printer continues to send Event
Notifications to the Notification Recipient as Events occur.


2  Terminology


This section defines the following terms that are used throughout this
document:


Capitalized terms, such as MUST, MUST NOT, REQUIRED, SHOULD, SHOULD NOT,
MAY, NEED NOT, and OPTIONAL, have special meaning relating to
conformance to this specification.  These terms are defined in [RFC2911



Herriot, et al.         Expires: March 18, 2001                 [page 6]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

section 13.1 on conformance terminology, most of which is taken from RFC
2119 [RFC2119].


Event Notification Lease: The lease that is associated with an Event
Notification. When the lease expires, the Printer discards the
associated Event Notification.


Event Notification Lease Time: The expiration time assigned to a lease
that is associated with an Event Notification.


Event Notification Attributes Group: The attributes group in a response
that contains attributes that are part of an Event Notification.


For other capitalized terms that appear in this document, see [ipp-
ntfy].


3  Model and Operation


In a Subscription Creation Operation, when the value of the "notify-
recipient-uri" attributes has the scheme 'ippget', the client is
requesting that the Printer use the 'ippget' Delivery Method for the
Event Notifications associated with the new Subscription Object. The
client SHOULD choose a value for the address part of the "notify-
recipient-uri" attribute that uniquely identifies the Notification
Recipient.


When an Event occurs, the Printer MUST generate an Event Notification
and MUST assign it the Event Notification Lease Time. The Printer MUST
hold an Event Notification for its assigned Event Notification Lease
Time. The Printer MUST assign the same Event Notification Lease Time to
each Event Notification.


When a Notification Recipient wants to receive Event Notifications, it
performs the Get-Notifications operation, which causes the Printer to
return all unexpired Event Notifications held for the Notification
Recipient. If the Notification Recipient has selected the option to wait
for additional Event Notifications, the response to the Get-
Notifications request continues indefinitely as the Printer continues to
send Event Notifications in the response as Events occur. For the Get-
Notification operation, the Printer sends only those Event Notifications
that are generated from Subscription Objects whose "notify-recipient-



Herriot, et al.         Expires: March 18, 2001                 [page 7]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

uri" equals the "notify-recipient-uri" Operation Attribute in the Get-
Notifications operation.





If a Notification Recipient performs the Get-Notifications operation
twice in quick succession, it will receive nearly the same Event
Notification both times because most of the Event Notifications are
those that the Printer saves for a few seconds after the Event occurs.
There are two possible differences. Some old Event Notifications may not
be present in the second response because their Event Notification
Leases have expired.  Some new Event Notifications may be present in the
second response but not the first response.


When the Notification Recipient requests Event Notifications for per-Job
Subscription Objects, the Notification Recipient typically performs the
Get-Notifications operation within a second of performing the
Subscription Creation operation.  Because the Printer is likely to save
Event Notifications for several seconds, the Notification Recipient is
unlikely to miss any Event Notifications that occur between the
Subscription Creation and the Get-Notifications operation.


4  General Information

If a Printer supports this Delivery Method, the following are its
characteristics.


            Table 1 - Information about the Delivery Method



     Document Method Conformance        Delivery Method Realization
             Requirement


  1.What is the URL scheme name     ippget
    for the Delivery Method?

  2.Is the Delivery Method          RECOMMENDED
    REQUIRED, RECOMMENDED or
    OPTIONAL for an IPP Printer to
    support?

  3.What transport and delivery     IPP with one new operation.



Herriot, et al.         Expires: March 18, 2001                 [page 8]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000


    protocols does the Printer use
    to deliver the Event
    Notification Content, i.e.,
    what is the entire network
    stack?

  4.Can several Event               Yes.
    Notifications be combined into
    a Compound Event Notification?

  5.Is the Delivery Method          This Delivery Method is a pull and
    initiated by the Notification   a push.
    Recipient (pull), or by the
    Printer (push)?

  6.Is the Event Notification       Machine Consumable
    content Machine Consumable or
    Human Consumable?

  7.What section in this document   Section 5
    answers the following
    question? For a Machine
    Consumable Event Notification,
    what is the representation and
    encoding of values defined in
    section 9.1 of [ipp-ntfy] and
    the conformance requirements
    thereof? For a Human
    Consumable Event Notification,
    what is the representation and
    encoding of pieces of
    information defined in section
    9.2 of [ipp-ntfy] and the
    conformance requirements
    thereof?

  8.What are the latency and        Same as IPP and the underlying HTTP
    reliability of the transport    transport
    and delivery protocol?

  9.What are the security aspects   Same as IPP and the underlying HTTP
    of the transport and delivery   transport
    protocol, e.g., how it is
    handled in firewalls?

  10.  What are the content length  None
    restrictions?




Herriot, et al.         Expires: March 18, 2001                 [page 9]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000


  11.  What are the additional      None
    values or pieces of
    information that a Printer
    sends in an Event Notification
    content and the conformance
    requirements thereof?

  12.  What are the additional      None
    Subscription Template and/or
    Subscription Description
    attributes and the conformance
    requirements thereof?

  13.  What are the additional
    Printer Description attributes
    and the conformance             None
    requirements thereof?




5  Get-Notifications operation


This operation causes the Printer to return all Event Notifications held
for the Notification Recipient.


A Printer MUST support this operation.


When a Printer performs this operation, it MUST return all and only
those Event Notifications:


     a)Whose associated Subscription Object's "notify-recipient-uri"
       attribute equals the "notify-recipient-uri" Operation attribute
       AND


     b)Whose associated Subscription Object's "notify-recipient-uri"
       attribute has a scheme value of 'ippget'  AND


     c)Whose Event Notification Lease Time has not yet expired AND


     d)Where the Notification Recipient is the owner of or has read-
       access rights to the associated Subscription Object.


Herriot, et al.         Expires: March 18, 2001                [page 10]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

The Printer MUST respond to this operation immediately with whatever
Event Notifications it currently holds. If the Notification Recipient
has selected the option to wait for additional Event Notifications, the
Printer MUST continue to send Event Notifications as they occur until
all of the associated Subscription Objects are cancelled.  A
Subscription Object is cancelled either via the Cancel-Subscription
operation or by the Printer (e.g. the Subscription Object is cancelled
when the associated Job completes).


Note, the Printer terminates the operation in the same way that it
normally terminates IPP operations. For example, if the Printer is
sending chunked data, it can send a 0 length chunk to denote the end of
the operation or it can close the connection.  If the Notification
Recipient wishes to terminate the Get-Notifications operation, it can
close the connection.


The Printer MUST accept the request in any state (see [RFC2911]
"printer-state" and "printer-state-reasons" attributes) and MUST remain
in the same state with the same "printer-state-reasons".

Access Rights: If the policy of the Printer is to allow all users to
access all Event Notifications, then the Printer MUST accept this
operation from any user. Otherwise, the authenticated user (see
[RFC2911] section 8.3) performing this operation MUST either be the
owner of each Subscription Object identified by the "notify-recipient-
uri" Operation attribute (as determined during a Subscription Creation
Operation) or an operator or administrator of the Printer (see [RFC2911]
Sections 1 and 8.5).  Otherwise, the IPP object MUST reject the
operation and return: 'client-error-forbidden', 'client-error-not-
authenticated', or 'client-error-not-authorized' as appropriate.


5.1 Get-Notifications Request

The following groups of attributes are part of the Get-Notifications
Request:

Group 1: Operation Attributes

  Natural Language and Character Set:
     The "attributes-charset" and "attributes-natural-language"
     attributes as described in [RFC2911] section 3.1.4.1.

  Target:
     The "printer-uri" (uri) operation attribute which is the target for
     this operation as described in [RFC2911] section 3.1.5.




Herriot, et al.         Expires: March 18, 2001                [page 11]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

  Requesting User Name:
     The "requesting-user-name" (name(MAX)) attribute SHOULD be supplied
     by the client as described in [RFC2911] section 8.3.

  "notify-recipient-uri" (url):
     The client MUST supply this attribute.  The Printer object MUST
     support this attribute. The Printer matches the value of this
     attribute (byte for byte with no case conversion) against the value
     of the "notify-recipient-uri" in each Subscription Object in the
     Printer. If there are no matches, the IPP Printer MUST return the
     'client-error-not-found' status code.  For each matched
     Subscription Object, the IPP Printer MUST return all unexpired
     Event Notifications associated with it. The Printer MUST send
     additional Event Notifications as Events occur if and only if the
     value of the "notify-no-wait" attribute is 'false' or not supplied
     by the client (see the next attribute below).

     Note: this attribute allows a subscribing client to pick URLs that
     are unique, e.g. the client's own URL or a friend's URL, which in
     both cases is likely the URL of the person's host. An application
     could make a URL unique for each application.

  "notify-no-wait" (boolean):
     The client MAY supply this attribute.  The Printer object MUST
     support this attribute. If the value of this attribute is 'false',
     the Printer MUST send all un-expired Event Notifications (as
     defined in the previous attribute) and it MUST continue to send
     responses for as long as the Subscription Objects associated with
     the specified "notify-recipient-uri" continue to exist. If the
     value of this attribute is 'true', the Printer MUST send all un-
     expired Event Notifications (as defined in the previous attribute)
     and the Printer MUST conclude the operation without waiting for any
     additional Events to occur. If the client doesn't supply this
     attribute, the Printer MUST behave as if the client had supplied
     this attribute with the value of 'false'.

5.2 Get-Notifications Response

The following groups of attributes are part of the Get-Notifications
Response:

Group 1: Operation Attributes

  Status Message:
     In addition to the REQUIRED status code returned in every response,
     the response OPTIONALLY includes a "status-message" (text(255))
     and/or a "detailed-status-message" (text(MAX)) operation attribute
     as described in [RFC2911] sections 13 and 3.1.6.




Herriot, et al.         Expires: March 18, 2001                [page 12]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

     The Printer can return any status codes defined in [RFC2911]. If
     the status code is not 'successful-', the Printer MUST NOT return
     any Event Notification Attribute groups. The following is a
     description of the important status codes:

       successful-ok: the response contains all Event Notification
          associated with the specified "notify-recipient-uri". If the
          specified Subscription Objects have no associated Event
          Notification, the response MUST contain zero Event
          Notifications.
       client-error-not-found: The Printer has no Subscription Object's
          whose "notify-recipient-uri" attribute equals the "notify-
          recipient-uri" Operation attribute.
       server-error-busy: The Printer is too busy to accept this
          operation. If the "suggested-ask-again-time-interval"
          operation attribute is present in the Operation Attributes of
          the response, then the Notification Recipient SHOULD wait for
          the number of seconds specified by the "suggested-ask-again-
          time-interval" attribute before performing this operation
          again. If the "suggested-ask-again-time-interval" Operation
          Attribute is not present, the Notification Recipient should
          use the normal network back-off algorithms for determining
          when to perform this operation again.
       redirection-other-site: The Printer does not handle this
          operation and requests the Notification Recipient to perform
          the operation with the uri specified by the "notify-ippget-
          redirect" Operation Attribute in the response..

  Natural Language and Character Set:
     The "attributes-charset" and "attributes-natural-language"
     attributes as described in [RFC2911] section 3.1.4.2.

     The Printer MUST use the values of "notify-charset" and "notify-
     natural-language", respectively, from one Subscription Object
     associated with the Event Notifications in this response.

     Normally, there is only one matched Subscription Object, or the
     value of the "notify-charset" and "notify-natural-language"
     attributes is the same in all Subscription Objects. If not, the
     Printer MUST pick one Subscription Object from which to obtain the
     value of these attributes. The algorithm for picking the
     Subscription Object is implementation dependent. The choice of
     natural language is not critical because 'text' and 'name' values
     can override the "attributes-natural-language" Operation attribute.
     The Printer's choice of charset is critical because a bad choice
     may leave it unable to send some 'text' and 'name' values
     accurately.





Herriot, et al.         Expires: March 18, 2001                [page 13]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

  "printer-up-time" (integer(0:MAX)):
     The value of this attribute is the Printer's "printer-up-time"
     attribute at the time the Printer sends this response. Because each
     Event Notification also contains the value of this attribute when
     the event occurred, the value of this attribute lets a Notification
     Recipient know when each Event Notification occurred relative to
     the time of this response.

   "suggested-ask-again-time-interval" (integer(0:MAX)):
     The value of this attribute is the number of seconds that the
     Notification Recipient SHOULD wait before trying this operation
     again when
          a)the Printer returns the 'server-error-busy' status code OR
          b)the Printer returns the 'successful-ok' status code and the
            client supplied the "notify-no-wait" attribute with a value
            of 'true'.
     This value is intended to help the client be a good network
     citizen.

  "notify-ippget-redirect" (uri):
     The value of this attribute is uri that the Notification Recipient
     MUST use for the Get-Notifications operation. This attribute is
     present in the Operation Attributes if and only if the status code
     has the value 'redirection-other-site'.

Group 2: Unsupported Attributes

     See [RFC2911] section 3.1.7 for details on returning Unsupported
     Attributes.

     If the "subscription-ids" attribute contained subscription-ids that
     do not exist, the Printer returns them in this group as value of
     the "subscription-ids" attribute.

Group 3 through N: Event Notification Attributes

     The Printer responds with one Event Notification Attributes Group
     per matched Event Notification. The initial matched Event
     Notifications are all un-expired Event Notification associated with
     the matched Subscription Objects. If the Notification Recipient has
     selected the option to wait for additional Event Notifications, the
     Printer the subsequent Event Notifications in the response are
     Event Notifications associated with the matched Subscription
     Objects as the corresponding Event occurs.

     From the Notification Recipient's view, the response appears as an
     initial burst of data, which includes the Operation Attributes
     Group and one Event Notification Attributes Groups per Event
     Notification that the Printer is holding.  After the initial burst
     of data, if the Notification Recipient has selected the option to


Herriot, et al.         Expires: March 18, 2001                [page 14]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

     wait for additional Event Notifications, the Notification Recipient
     receives occasional Event Notification Attribute Groups. Proxy
     servers may delay some Event Notifications or cause time-outs to
     occur. The client MUST be prepared to perform the Get-Notifications
     operation again when time-outs occur.

     Each Event Notification Group MUST start with an 'event-
     notification-attributes-tag' (see the section "Encodings of
     Additional Attribute Tags" in [ipp-ntfy]).

     Each attribute is encoded using the IPP rules for encoding
     attributes [RFC2910] and may be encoded in any order. Note: the
     Get-Jobs response in [RFC2911] acts as a model for encoding
     multiple groups of attributes.

     Each Event Notification Group MUST contain all of attributes
     specified in section 9.1 ("Content of Machine Consumable Event
     Notifications") of [ipp-ntfy] with exceptions denoted by asterisks
     in the tables below.

     The tables below are copies of the tables in section 9.1 ("Content
     of Machine Consumable Event Notifications") of [ipp-ntfy] except
     that each cell in the "Sends" column is a  "MUST".

     For an Event Notification for all Events, the Printer includes the
     following attributes.

             Table 2 - Attributes in Event Notification Content



                    Source Value                  Sends   Source Object



     notify-subscription-id (integer(1:MAX))      MUST    Subscription



     notify-printer-uri (uri)                     MUST    Subscription



     notify-subscribed-event (type2 keyword)      MUST    Event
                                                          Notification







Herriot, et al.         Expires: March 18, 2001                [page 15]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000



                    Source Value                  Sends   Source Object



     printer-up-time (integer(MIN:MAX))           MUST    Printer



     printer-current-time (dateTime)*             MUST    Printer



     notify-sequence-number (integer (0:MAX))     MUST    Subscription



     notify-charset (charset)                     MUST    Subscription



     notify-natural-language (naturalLanguage)    MUST    Subscription



     notify-user-data (octetString(63)) **        MUST    Subscription



     notify-text (text)                           MUST    Event
                                                          Notification



     attributes from the "notify-attributes"      MUST    Printer
     attribute ***



     attributes from the "notify-attributes"      MUST    Job
     attribute ***



     attributes from the "notify-attributes"      MUST    Subscription
     attribute ***





Herriot, et al.         Expires: March 18, 2001                [page 16]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

     * The Printer MUST send "printer-current-time" if and only if it
     supports the "printer-current-time" attribute on the Printer
     object.

     ** If the associated Subscription Object does not contain a
     "notify-user-data" attribute, the Printer MUST send an octet-string
     of length 0.

     *** If the "notify-attributes" attribute is present on the
     Subscription Object, the Printer MUST send all attributes specified
     by the "notify-attributes" attribute. Note: if the Printer doesn't
     support the "notify-attributes" attribute, it is not present on the
     associated Subscription Object.

     For Event Notifications for Job Events, the Printer includes the
     following additional attributes.

      Table 3 - Additional Attributes in Event Notification Content for
                                 Job Events



                    Source Value                  Sends   Source Object



     job-id (integer(1:MAX))                      MUST    Job



     job-state (type1 enum)                       MUST    Job



     job-state-reasons (1setOf type2 keyword)     MUST    Job



     job-impressions-completed                    MUST    Job
     (integer(0:MAX)) *



     *  The Printer MUST send the "job-impressions-completed" attribute
     in an Event Notification only for the combinations of Events and
     Subscribed Events shown in Table 4.






Herriot, et al.         Expires: March 18, 2001                [page 17]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

      Table 4 - Combinations of Events and Subscribed Events for "job-
                           impressions-completed"



     Job Event                  Subscribed Job Event



     'job-progress'             'job-progress'



     'job-completed'            'job-completed'



     'job-completed'            'job-state-changed'



     For Event Notification for Printer Events, the Printer includes the
     following additional attributes.

      Table 5 - Additional Attributes in Event Notification Content for
                               Printer Events



                    Source Value                  Sends   Source Object



     printer-state (type1 enum)                   MUST    Printer



     printer-state-reasons (1setOf type2          MUST    Printer
     keyword)



     printer-is-accepting-jobs (boolean)          MUST    Printer









Herriot, et al.         Expires: March 18, 2001                [page 18]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

6  Additional Printer Description Attributes


6.1 begin-to-expire-time-interval" (integer(0:MAX))


This attribute specifies the number of seconds that a Printer keeps an
Event Notification that is associated with this Delivery Method.


The Printer MUST support this attribute if it supports this Delivery
Method.


The value of this attribute is the minimum number of seconds that MUST
elapse between the time the Printer creates an Event Notification object
for this Delivery Method and the time the Printer discards the same
Event Notification.


For example, assume the following:


  1. a client performs a Job Creation operation that creates a
     Subscription Object associated with this Delivery Method, AND


  2. an Event associated with the new Job occurs immediately after the
     Subscription Object is created, AND


  3. the same client or some other client performs a Get-Notifications
     operation N seconds after the Job Creation operation.


Then, if N is less than the value of this attribute, the client
performing the Get-Notifications operations can expect not miss any
Event-Notifications, barring some unforeseen lack of memory space in the
Printer.



7  New Status Codes


The following status codes are defined as extensions for this Delivery
Method and are returned as the status code of the Get-Notifications
operation.




Herriot, et al.         Expires: March 18, 2001                [page 19]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

7.1 redirection-other-site (0x300)

This status code means that the Printer doesn't perform that Get-
Notifications operation and that the "notify-ippget-redirect" Operation
Attribute in the response contains the uri that the Notification
Recipient MUST use for performing the Get-Notifications operation.

8  Encoding


The operation-id assigned for the Get-Notifications operation is:


     0x001C


and should be added to the next version of [RFC2911] section 4.4.15
"operations-supported".


This notification delivery method uses the IPP transport and encoding
[RFC2910] for the Get-Notifications operation with one extension:


          notification-attributes-tag = %x07                   ; tag of
          7


9  Conformance Requirements


If the Printer supports the 'ippget' Delivery Method, the Printer MUST:


1.meet the conformance requirements defined in [ipp-ntfy].


2.support the Get-Notifications operation defined in section 5.


3.support the "begin-to-expire-time-interval" attribute defined in
  section 6.1.


4.support the "redirection-other-site" status code defined 7.1







Herriot, et al.         Expires: March 18, 2001                [page 20]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

10 IANA Considerations


There is nothing to register.


11 Internationalization Considerations


The IPP Printer MUST localize the "notify-text" attribute as specified
in section 14 of [ipp-ntfy].


In addition, when the client receives the Get-Notifications response, it
is expected to localize the attributes that have the 'keyword' attribute
syntax according to the charset and natural language requested in the
Get-Notifications request.


12 Security Considerations


The IPP Model and Semantics document [RFC2911] discusses high-level
security requirements (Client Authentication, Server Authentication and
Operation Privacy).  Client Authentication is the mechanism by which the
client proves its identity to the server in a secure manner.  Server
Authentication is the mechanism by which the server proves its identity
to the client in a secure manner.  Operation Privacy is defined as a
mechanism for protecting operations from eavesdropping.


Unlike other Event Notification delivery methods in which the IPP
Printer initiates the Event Notification, with the method defined in
this document, the Notification Recipient is the client who   s the Get-
Notifications operation.  Therefore, there is no chance of "spam"
notifications with this method.  Furthermore, such a client can close
down the HTTP channel at any time, and so can avoid future unwanted
Event Notifications at any time.


13 References

 [ipp-ntfy]
     R. Herriot, Hastings, T., Isaacson, S., Martin, J., deBry, R.,
     Shepherd, M., Bergman, R., "Internet Printing Protocol/1.1: IPP
     Event Notification Specification", <draft-ietf-ipp-not-spec-
     04.txt>, June 30, 2000.





Herriot, et al.         Expires: March 18, 2001                [page 21]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

 [rfc2026]
     S. Bradner, "The Internet Standards Process -- Revision 3", RFC
     2026, October 1996.

[RFC2616]
     R. Fielding, J. Gettys, J. Mogul, H. Frystyk, L. Masinter, P.
     Leach, T. Berners-Lee, "Hypertext Transfer Protocol - HTTP/1.1",
     RFC 2616, June 1999.

[RFC2910]
     Herriot, R., Butler, S., Moore, P., Tuner, R., "Internet Printing
     Protocol/1.1: Encoding and Transport", RFC 2910, September 2000.

[RFC2911]
     R. deBry, T. Hastings, R. Herriot, S. Isaacson, P. Powell,
     "Internet Printing Protocol/1.1: Model and Semantics", RFC 2911,
     September 2000.


14 Authors' Addresses


   Robert Herriot
   Xerox Corp.
   3400 Hill View Ave, Building 1
   Palo Alto, CA 94304

   Phone: 650-813-7696
   Fax:  650-813-6860
   e-mail: robert.herriot@pahv.xerox.com

   Carl Kugler
   IBM
   P.O. Box 1900
   Boulder, CO 80301-9191

   Phone:
   Fax:
   e-mail: kugler@us.ibm.com

   Harry Lewis
   IBM
   P.O. Box 1900
   Boulder, CO 80301-9191

   Phone: 303-924-5337
   FAX:
   e-mail:  harryl@us.ibm.com




Herriot, et al.         Expires: March 18, 2001                [page 22]



INTERNET-DRAFT     IPP: The 'ippget' Delivery Method September 18, 2000

15 Full Copyright Statement

Copyright (C) The Internet Society (2000). All Rights Reserved.

This document and translations of it may be copied and furnished to
others, and derivative works that comment on or otherwise explain it or
assist in its implementation may be prepared, copied, published and
distributed, in whole or in part, without restriction of any kind,
provided that the above copyright notice and this paragraph are included
on all such copies and derivative works.  However, this document itself
may not be modified in any way, such as by removing the copyright notice
or references to the Internet Society or other Internet organizations,
except as needed for the  purpose of developing Internet standards in
which case the procedures for copyrights defined in the Internet
Standards process must be followed, or as required to translate it into
languages other than English.

The limited permissions granted above are perpetual and will not be
revoked by the Internet Society or its successors or assigns.

This document and the information contained herein is provided on an "AS
IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK
FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT
LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT
INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR
FITNESS FOR A PARTICULAR PURPOSE.


























Herriot, et al.         Expires: March 18, 2001                [page 23]
